/* failure reason */
"Action is not authorized for the Synology user." = "Action is not authorized for the Synology user.";

/* failure reason */
"An invalid API name was provided to the Synology API." = "An invalid API name was provided to the Synology API.";

/* failure reason */
"An invalid method name was provided to the Synology API." = "An invalid method name was provided to the Synology API.";

/* failure reason */
"An invalid parameter was provided to the Synology API." = "An invalid parameter was provided to the Synology API.";

/* failure reason */
"An unknown Synology API error occurred." = "An unknown Synology API error occurred.";

/* error description */
"API info not yet downloaded from Synology" = "API info not yet downloaded from Synology";

/* failure reason */
"Bad Real-Debrid API key." = "Bad Real-Debrid API key.";

/* recovery suggestion */
"Call getAPIs() before making API calls using the Synology client." = "Call getAPIs() before making API calls using the Synology client.";

/* recovery suggestion */
"Check the output of getAPIs() to verify you are using the correct API name." = "Check the output of getAPIs() to verify you are using the correct API name.";

/* recovery suggestion */
"Consult the Real-Debrid API documentation for more information." = "Consult the Real-Debrid API documentation for more information.";

/* recovery suggestion */
"Consult the Synology API documentation for more information." = "Consult the Synology API documentation for more information.";

/* failure reason */
"Couldn’t download torrent “%@”: An unknown error occurred." = "Couldn’t download torrent “%@”: An unknown error occurred.";

/* failure reason */
"Couldn’t download torrent “%@”: Failed to get magnet data." = "Couldn’t download torrent “%@”: Failed to get magnet data.";

/* failure reason */
"Couldn’t download torrent “%@”: Torrent contains a virus." = "Couldn’t download torrent “%@”: Torrent contains a virus.";

/* failure reason */
"Couldn’t download torrent “%@”: Torrent is dead." = "Couldn’t download torrent “%@”: Torrent is dead.";

/* recovery suggestion */
"Double-check the value passed to the -r option." = "Double-check the value passed to the -r option.";

/* error description */
"Given Synology API version is unsupported" = "Given Synology API version is unsupported";

/* error description */
"Improperly formatted URL" = "Improperly formatted URL";

/* recovery suggestion */
"Make a login request before using that API method." = "Make a login request before using that API method.";

/* recovery suggestion */
"Make sure you are a premium Real-Debrid subscriber, and your account is in good standing." = "Make sure you are a premium Real-Debrid subscriber, and your account is in good standing.";

/* error description */
"Must be logged in to use that Synology API method" = "Must be logged in to use that Synology API method";

/* error description */
"Non-success response from Real-Debrid API" = "Non-success response from Real-Debrid API";

/* error description */
"Non-success response from RSS provider" = "Non-success response from RSS provider";

/* failure reason */
"Real-Debrid account is not authorized." = "Real-Debrid account is not authorized.";

/* failure reason */
"Real-Debrid API returned error %d (%@): %@" = "Real-Debrid API returned error %1$d (%2$@): %3$@";

/* error description */
"Real-Debrid couldn’t download torrent." = "Real-Debrid couldn’t download torrent.";

/* recovery suggestion */
"Retrieve a new session by making another login request to the Synology API." = "Retrieve a new session by making another login request to the Synology API.";

/* failure reason */
"Synology API is not supported in the provided version." = "Synology API is not supported in the provided version.";

/* failure reason */
"Synology API method called before API info was downloaded." = "Synology API method called before API info was downloaded.";

/* failure reason */
"Synology API “%@” was not found in API info." = "Synology API “%@” was not found in API info.";

/* failure reason */
"That Synology API requires a logged-in session." = "That Synology API requires a logged-in session.";

/* failure reason */
"The current Synology session was interrupted by another login." = "The current Synology session was interrupted by another login.";

/* failure reason */
"The response from “%@” had status code %d." = "The response from “%1$@” had status code %2$d.";

/* failure reason */
"The response from “%@” was not an HTTP response." = "The response from “%@” was not an HTTP response.";

/* error description */
"The Synology API returned an error" = "The Synology API returned an error";

/* failure reason */
"The Synology session has timed out." = "The Synology session has timed out.";

/* failure reason */
"The URL “%@” could not be parsed as a URL." = "The URL “%@” could not be parsed as a URL.";

/* recovery suggestion */
"Try a different torrent or magnet URL." = "Try a different torrent or magnet URL.";

/* recovery suggestion */
"Try the download again later." = "Try the download again later.";

/* recovery suggestion */
"Try using a newer or older API version." = "Try using a newer or older API version.";

/* error description */
"Unexpected response from Real-Debrid API" = "Unexpected response from Real-Debrid API";

/* error description */
"Unexpected response from RSS provider" = "Unexpected response from RSS provider";

/* error description */
"Unexpected response from Synology API" = "Unexpected response from Synology API";

/* error description */
"Unknown Synology API" = "Unknown Synology API";

/* recovery suggestion */
"Validate the data you are passing to the Synology API." = "Validate the data you are passing to the Synology API.";

/* recovery suggestion */
"Verify that the RSS feed is returning correct magnetic URLs." = "Verify that the RSS feed is returning correct magnetic URLs.";

/* recovery suggestion */
"Verify that the server is accessible from your computer." = "Verify that the server is accessible from your computer.";

/* recovery suggestion */
"Verify that the Synology API hostname and path is correct." = "Verify that the Synology API hostname and path is correct.";

/* recovery suggestion */
"Verify the permissions granted to the Synology user." = "Verify the permissions granted to the Synology user.";

/* recovery suggestion */
"Verify the RSS URL passed to rss-debrider." = "Verify the RSS URL passed to rss-debrider.";

/* failure reason */
"Version %u is not supported for Synology API “%@”." = "Version %1$u is not supported for Synology API “%2$@”.";

